#
# 以下配置文件均为实际代码，对格式有严格要求，请遵守：
# 1. 行首缩紧必须用tab, 不能使用空格，尤其不能空格与tab混用
# 2. 英文井号 # 开头为注释，可随便写
# 3. 连续3个单引号 ''' ... ''' 标示整段的注释，起始位置要纵向对齐
#

##############################################
# POS 系统显示分类
CATEGORY = {
	'001' : '新鲜水果', #'掌柜优选',
	'002' : '缤纷饮料', #'新鲜水果',
	'003' : '休闲零食', #'水灵蔬菜',
	'004' : '蛋奶便当', #'无肉不欢',
	'005' : '精选团购', #'极鲜水货',
	'006' : 'U+禮卡', #'天下粮仓',
	'007' : '水果伴侣', #'零食小吃',
}

# for V2 --------------------------------------------

# APP类目标题，根据需要修改
CATEGORY2 = {
	'c001' : ('新鲜水果','急速送达'),
	'c002' : ('缤纷饮料','清凉解渴'),
	'c003' : ('休闲零食','馋嘴必备'),
	'c004' : ('蛋奶便当','包你三餐'),
	'c005' : ('精选团购','1单包邮'),
	'c006' : ('U+禮卡','掌柜有礼'),
	'c007' : ('水果伴侣','洗果神器'),
}

# 微信类目，与app一致，一般不需要修改
CATEGORY2_WX = {
	'001' : CATEGORY2['c001'], '002' : CATEGORY2['c002'], '003' : CATEGORY2['c003'], '004' : CATEGORY2['c004'],
	'005' : CATEGORY2['c005'], '006' : CATEGORY2['c006'], '007' : CATEGORY2['c007'],
}

# 类目banner的图片地址，更新前要将相应图片上传到pos服务器，如果有修改文件名必须不同
BANNER = {
	'c001' : ('/banner20151124_1.jpg','/banner20151124_2.jpg','/banner20151122_1.jpg'),
	'c002' : ('/banner20151124_1.jpg','/banner20151124_2.jpg','/banner20151122_1.jpg'),
	'c003' : ('/banner20151124_1.jpg','/banner20151124_2.jpg','/banner20151122_1.jpg'),
	'c004' : ('/banner20151124_1.jpg','/banner20151124_2.jpg','/banner20151122_1.jpg'),
	'c005' : ('/banner20151124_1.jpg','/banner20151124_2.jpg','/banner20151122_1.jpg'),
	'c006' : ('/banner20151124_1.jpg','/banner20151124_2.jpg','/banner20151122_1.jpg'),
	'c007' : ('/banner20151124_1.jpg','/banner20151124_2.jpg','/banner20151122_1.jpg'),
}
# 微信banner图片，不需要修改
BANNER_WX = {
	'001' : BANNER['c001'], '002' : BANNER['c002'], '003' : BANNER['c003'], '004' : BANNER['c004'],
	'005' : BANNER['c005'], '006' : BANNER['c006'], '007' : BANNER['c007'],
}

# 类目banner点击url
BANNER_URL = {
	'c001' : ('http://dwz.cn/2dTIiS','',''),
	'c002' : ('http://dwz.cn/2dTIiS','',''),
	'c003' : ('http://dwz.cn/2dTIiS','',''),
	'c004' : ('http://dwz.cn/2dTIiS','',''),
	'c005' : ('http://dwz.cn/2dTIiS','',''),
	'c006' : ('http://dwz.cn/2dTIiS','',''),
	'c007' : ('http://dwz.cn/2dTIiS','',''),
}
# 微信类目banner点击url，不需要修改
BANNER_URL_WX = {
	'001' : BANNER_URL['c001'], '002' : BANNER_URL['c002'], '003' : BANNER_URL['c003'], '004' : BANNER_URL['c004'],
	'005' : BANNER_URL['c005'], '006' : BANNER_URL['c006'], '007' : BANNER_URL['c007'],
}

# for V3 -------------------------------------------

# app不同门店的不同banner设置
BANNER_shop = {
	#'55b7ae5a5e0bdc3041c3f068' : { # 张江
	#	'c001' : ('/banner20151012_2.png','/banner20151018_2.jpg','/banner20151016_3.jpg'),
	#	'c002' : ('/banner20151012_2.png','/banner20151018_2.jpg','/banner20151016_3.jpg'),
	#	'c003' : ('/banner20151012_2.png','/banner20151018_2.jpg','/banner20151016_3.jpg'),
	#	'c004' : ('/banner20151012_2.png','/banner20151018_2.jpg','/banner20151016_3.jpg'),
	#	'c005' : ('/banner20151012_2.png','/banner20151018_2.jpg','/banner20151016_3.jpg'),
	#	'c006' : ('/banner20151012_2.png','/banner20151018_2.jpg','/banner20151016_3.jpg'),
	#	'c007' : ('/banner20151012_2.png','/banner20151018_2.jpg','/banner20151016_3.jpg'),
	#}
}

# 微信不同门店的不同banner设置
BANNER_shop_WX = {
	#'55b7ae5a5e0bdc3041c3f068' : { # 张江
	#	'001' : ('/banner20151012_2.png','/banner20151018_2.jpg','/banner20151016_3.jpg'),
	#	'002' : ('/banner20151012_2.png','/banner20151018_2.jpg','/banner20151016_3.jpg'),
	#	'003' : ('/banner20151012_2.png','/banner20151018_2.jpg','/banner20151016_3.jpg'),
	#	'004' : ('/banner20151012_2.png','/banner20151018_2.jpg','/banner20151016_3.jpg'),
	#	'005' : ('/banner20151012_2.png','/banner20151018_2.jpg','/banner20151016_3.jpg'),
	#	'006' : ('/banner20151012_2.png','/banner20151018_2.jpg','/banner20151016_3.jpg'),
	#	'007' : ('/banner20151012_2.png','/banner20151018_2.jpg','/banner20151016_3.jpg'),
	#}
}

# app类目banner点击url, 不同门店的设置
BANNER_URL_shop = {
	#'55b7ae5a5e0bdc3041c3f068' : { # 张江
	#	'c001' : ('','',''),
	#	'c002' : ('','',''),
	#	'c003' : ('','',''),
	#	'c004' : ('','',''),
	#	'c005' : ('','',''),
	#	'c006' : ('','',''),
	#	'c007' : ('','',''),
	#}
}

# 微信类目banner点击url, 不同门店的设置
BANNER_URL_shop_WX = {
	#'55b7ae5a5e0bdc3041c3f068' : { # 张江
	#	'001' : ('','',''),
	#	'002' : ('','',''),
	#	'003' : ('','',''),
	#	'004' : ('','',''),
	#	'005' : ('','',''),
	#	'006' : ('','',''),
	#	'007' : ('','',''),
	#}
}

# for V3 end -------------------------------------------


# 开机提醒，一般不需要改
start_alert = False
start_message = '软件有更新，请更新版本'
update_build = '' # 只用于安卓
update_url = '' # 只用于安卓

# 默认免邮门槛、运费
free_delivery = 19.9  # 免邮门槛
delivery_fee = 5  # 邮费

# for V3 -------------------------------------------

# by站点，邮费，免邮门槛
delivery_by_shop = {
	#'559d03405e0bdc5d33516be0' : {'free_delivery':5, 'delivery_fee': 1}, # 辽源西路
	#'55cf47ec5e0bdc2a446c6141' : {'free_delivery':0, 'delivery_fee': 0}, # 花木
}

# for V3 end -------------------------------------------


# ------  不首单立减，注册后发券
# 默认首单立减设置
first_promote = 0    # 首单立减
first_promote_threshold = 10000    # 首单立减

# 指定站点首单立减设置
first_promote2 = 0
first_promote2_threshold = 10000    # 首单立减
first_promote2_shop = [     # 首单立减站点
	#'55b7ae5a5e0bdc3041c3f068'  # 张江－ 测试
	#'55d967f25e0bdc65b295e9f0', # 松江大学城
	#'55e26cb05e0bdc2219b049d1', # 宝山店
] 

# v1, v2 api 买一送一设置
buy_1_give_1 = [ # 买一送一品号      # v2有效
	'1130000689',  # 2015-10-18
	#'1130000693',
	'1210000551',
	'1130000720',
	'1130000730',
	'1130000735',
	'1130000758', # 20151101
	'1130000759', # 20151101
	'1130000795',
        '1130000856',
        '1130000563',
        '1130000873',
        '1210000769',
] 

# v3 api 买X送Y设置
# 注意：为新旧版本兼容，上面 buy_1_give_1 与下面 buy_X_give_Y 要一同设置
buy_X_give_Y = { # 买X送Y件格式： '品号' : (X, Y)      # v3有效
	'1130000689' : (1, 1),
	'1210000551' : (1, 1),
	'1130000720' : (1, 1),
	'1130000730' : (1, 1),
	'1130000735' : (1, 1),
	'1130000758' : (1, 1),
	'1130000759' : (1, 1),
	'1130000795' : (1, 1),
        '1130000856' : (1, 1),
        '1130000563' : (1, 1),
        '1130000873' : (1, 1),
        '1210000769' : (1, 1),
}

# v3 api 互斥商品
only_one = [] #例如 [ '1130000234', '1130000221', '1130000235' ]

# 支付相关的开关，不需要修改
alipay_enable = True
wxpay_enable = True
credit_enable = True
cod_enable = False

# gps距离提醒，不需要修改
max_alert_distance = 100 # 

# 默认推荐标签(首页、详情页)，不需要修改
defaut_promote_img = '/promote.png'
defaut_promote_img2 = '/promote.png'

'''
# 发抵用券设置, 首单后发
new_coupon = [ # (金额， 门槛， 类型)  类型：all 普通抵用，apple 水果券
	(6, 29.9, 'all'),
	(9, 39.9, 'all'),
]

# 发特点抵用券的站点，首单后发
new_coupon2 = [ # (金额， 门槛， 类型)  类型：all 普通抵用，apple 水果券
	(5, 20, 'apple'),
	(5, 20, 'apple'),
	(5, 20, 'apple'),
]
new_coupon2_shop = [
	#'55b7ae5a5e0bdc3041c3f068',  # 张江店， 测试
	'55d967f25e0bdc65b295e9f0', # 松江大学城
	'55e26cb05e0bdc2219b049d1', # 宝山店
]

'''

# -------- 首单后不发券－－－－－－－ 不需要修改
# 默认发抵用券设置, 首单后发
new_coupon = [ # (金额， 门槛， 类型)  类型：all 普通抵用，apple 水果券
]

# 发特点抵用券的站点，首单后发－－－－－－－ 不需要修改
new_coupon2 = [ # (金额， 门槛， 类型)  类型：all 普通抵用，apple 水果券
]
new_coupon2_shop = [
]

# 注册后发券 ---- －－－－－－－ 不需要修改
reginster_coupon = [ # (金额， 门槛， 类型)  类型：all 普通抵用，apple 水果券
	(3, 19.9, 'apple'),
	(3, 19.9, 'apple'),
	(4, 24.9, 'apple'),
]

# 左上角角标设置 ----- v2, v3
left_tag = {
	'default'  : '/promote.png',
	'default2' : '/promote.png', # 详情页
	'tags'    : [ 
		{ # 买一送一
			'skus' : [  # skus 所列为需要打此标签的商品品号
				'1130000689',
				'1130000693',
				'1210000551',
				'1130000720',
				'1130000730',
				'1130000735',
				'1130000758', # 20151101
				'1130000759', # 20151101
				'1130000795',
                                '1130000856',
                                '1130000563',
                                '1130000873',
                                '1210000769',
			],
			'tag'  : '/promote5.png', # 图片文件需要保证已经上传到pos服务器，如果有修改文件名必须不同
			'tag2' : '/promote5.png', # 详情页
		},
		{ # 限量
			'skus' : ['1110000653','1110000654','1110000655','1010000815'],
			'tag'  : '/promote19.png', 
			'tag2' : '/promote19.png', # 详情页
		},
		#{ # 组合优惠
		#	'skus' : ['1110000697','1110000698'],
		#	'tag'  : '/promote6.png', 
		#	'tag2' : '/promote6.png', # 详情页
		#},
		{ # 省3元
			'skus' : ['1110000697'],
			'tag'  : '/promote7.png', 
			'tag2' : '/promote7.png', # 详情页
		},
		{ # 省4元
			'skus' : ['1110000698'],
			'tag'  : '/promote8.png', 
			'tag2' : '/promote8.png', # 详情页
		},
		{ # 包邮
			'skus' : [],
			'tag'  : '/promote9.png', 
			'tag2' : '/promote9.png', # 详情页
		},
		{ # 一贵就赔
			'skus' : [''],
			'tag'  : '/promote12.jpg', 
			'tag2' : '/promote12.jpg', # 详情页
		},
		{ # 限时
			'skus' : [],
			'tag'  : '/promote11.png', 
			'tag2' : '/promote11.png', # 详情页
		},
		{ # 逼格
			'skus' : [],
			'tag'  : '/bigger.jpg', 
			'tag2' : '/bigger.jpg', # 详情页
		},
		{ # 柚惑
			'skus' : ['1130000277'],
			'tag'  : '/promote13.png', 
			'tag2' : '/promote13.png', # 详情页
		},
		{ # 限时特惠
			'skus' : ['1210000372','1210000373','1210000472','1210000473','1210000339','1210000442','1210000438','1210000448','1210000445','1010000791'],
			'tag'  : '/promote14.jpg', 
			'tag2' : '/promote14.jpg', # 详情页
		},
		{ # 法兰西
			'skus' : ['1130000840'],
			'tag'  : '/promote17.png', 
			'tag2' : '/promote17.png', # 详情页
		},
		#{ # 蝴蝶结
		#	'skus' : [''],
		#	'tag'  : '/promote18.png', 
		#	'tag2' : '/promote18.png', # 详情页
		#},
		{ # 热销
			'skus' : ['1130000741'],
			'tag'  : '/promote16a.png', 
			'tag2' : '/promote16a.png', # 详情页
		},
                #{ # 赠送水果
		#	'skus' : ['1210000850','1210000852','1210000851','1210000853'],
		#	'tag'  : '/promote20.png', 
		#	'tag2' : '/promote20.png', # 详情页
		#},
                { # 送水果
			'skus' : ['1210000850','1210000852','1210000851','1210000853'],
			'tag'  : '/promote21.png', 
			'tag2' : '/promote21.png', # 详情页
		},
                { # 暖心推荐
			'skus' : ['1130000864'],
			'tag'  : '/promote22.png', 
			'tag2' : '/promote22.png', # 详情页
		},
	]
}

# for V2 end -------------------------------------------

